Центр_управления_производительностью_демо/src/Enums/ТипыСУБД/ТипыСУБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСУБД</name>
  <enumValues>
    <name>MSSQLServer</name>
  </enumValues>
  <enumValues>
    <name>IBMDB2</name>
  </enumValues>
  <enumValues>
    <name>PostgreSQL</name>
  </enumValues>
  <enumValues>
    <name>Oracle</name>
  </enumValues>
  <enumValues>
    <name>DBV8DBEng</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Enums/РежимыУправленияБлокировкойДанных/РежимыУправленияБлокировкойДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыУправленияБлокировкойДанных</name>
  <enumValues>
    <name>Автоматический</name>
  </enumValues>
  <enumValues>
    <name>Управляемый</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическийИУправляемый</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Catalogs/Сценарии/Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сценарии</name>
  <predefined>
    <items>
      <name>Базовый</name>
      <description>Базовый</description>
    </items>
    <items>
      <name>Мониторинг</name>
      <description>Мониторинг</description>
    </items>
    <items>
      <name>Просмотр</name>
      <description>Просмотр</description>
    </items>
  </predefined>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальноеСостояние</name>
    <comment>Начальное состояние</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Структура</name>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СледующееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыСобытия</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыКоманды</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Catalogs/Показатели/Показатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Показатели</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Анализ</name>
      <description>Анализ</description>
    </items>
    <items>
      <name>Взаимоблокировки</name>
      <description>Взаимоблокировки</description>
    </items>
    <items>
      <name>Запросы</name>
      <description>Запросы</description>
    </items>
    <items>
      <name>Качество</name>
      <description>Качество</description>
    </items>
    <items>
      <name>ОжиданияНаБлокировках</name>
      <description>Ожидания на блокировках</description>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ПроизводительностьОборудования</name>
      <description>Производительность оборудования</description>
    </items>
    <items>
      <name>СерверныеВызовы</name>
      <description>Серверные вызовы</description>
    </items>
  </predefined>
  <attributes>
    <name>ГраницаЖК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаЗЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Масштаб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметр</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
        <types>EnumRef.СпособыСбораСчетчиков</types>
        <types>CatalogRef.СчетчикиПроизводительности</types>
        <types>CatalogRef.АгентыЦКК</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоддержкаСУБД</name>
    <attributes>
      <name>АвтоматическийРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСУБД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмешанныйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОС</name>
      <type>
        <types>EnumRef.ТипыОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСУБД</name>
      <type>
        <types>EnumRef.ТипыСУБД</types>
      </type>
    </attributes>
    <attributes>
      <name>УправляемыйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/CommonModules/КонтекстВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПОДКЛЮЧЕНИЯ

// Получить подключение к информационной базе
//
// Возвращаемое значение:
//  Структура - (см. ИнформационнаяБаза.ПодключениеИБ())
//
Функция ПодключениеИБ(ИБ) Экспорт
	
	ПодключениеИБ = ИнформационнаяБаза.ПодключениеИБ(
		ИБ);
	
	Возврат ПодключениеИБ;
	
КонецФункции // ПодключениеИБ()

// Получить словарь метаданных состоящий из шаблонов имен таблиц
// При первом обращении, подключается к ИБ, получает структуру базы, получает
// словарь и сохраняет в контексте.
//
// Возвращаемое значение:
//  Соответствие, Названия таблиц в терминах метаданных 1С, возвращаемое значение.
//
Функция СловарьШаблонов(ПодключениеИБ) Экспорт
	
	СловарьШаблонов =
		СтруктураМетаданных.ПолучитьСловарьШаблоновМетаданных(
			СтруктураХраненияБазы(ПодключениеИБ));
		
	Возврат СловарьШаблонов;
	
КонецФункции // СловарьШаблонов()

// Получить COM-соедиение с информационной базой
//
// Возвращаемое значение:
//  COM-Соедиение - (см. ИнформационнаяБаза.СоединениеИБ())
//
Функция Соединитель(глКонтекст) Экспорт
	
	Если глКонтекст.Соединитель = Неопределено Тогда
		глКонтекст.Соединитель = ОбщегоНазначения.ПолучитьComСоединитель();
	КонецЕсли;
		
	Возврат глКонтекст.Соединитель;
	
КонецФункции // Соединитель()

// Получить COM-соедиение с информационной базой
//
// Возвращаемое значение:
//  COM-Соедиение - (см. ИнформационнаяБаза.СоединениеИБ())
//
Функция СоединениеИБ(ПодключениеИБ) Экспорт
	
	СоединениеИБ = ИнформационнаяБаза.СоединениеИБ(ПодключениеИБ);
	
	Возврат СоединениеИБ;
	
КонецФункции // СоединениеИБ()

// Получить список соединений с рабочими процессами
//
// Возвращаемое значение:
//  Массив - подключения к рабочим процессам
//
Функция СоединенияРП(Соединитель, ПодключениеИБ, СоединенияРП, НачалоСоединенияРП, ИнтервалОбновленияПодключенийРП) Экспорт
	
	Если ТекущаяДата() - НачалоСоединенияРП > ИнтервалОбновленияПодключенийРП Тогда
		Если СоединенияРП = Неопределено Тогда
			СоединенияРП = ИнформационнаяБаза.СоздатьСоединенияРП();
		КонецЕсли;
		
		//ПодключениеИБ = глКонтекст.ПодключениеИБ;
		ИнформационнаяБаза.ОбновитьСоединенияРП(
			СоединенияРП,
			Соединитель, //Соединитель(глКонтекст),
			ПодключениеИБ.АгентСервера,
			ПодключениеИБ.ПараметрыИБ.ПортКластера,
			ПодключениеИБ.ИнформационнаяБаза.ИмяПользователяИБ,
			ПодключениеИБ.ИнформационнаяБаза.ПарольПользователяИБ);
		НачалоСоединенияРП = ТекущаяДата();
	КонецЕсли;
		
	Возврат СоединенияРП;
	
КонецФункции // СоединенияРП()

// Функция возвращает структуру хранения базы данных в виде ТаблицыЗначений.
// При первом обращении к структуре, подключется к ИБ, получает структуру базы
// и сохраняет в контексте.
//
// Возвращаемое значение:
//  ТаблицаЗначений, Структура хранения базы данных
//
Функция СтруктураХраненияБазы(ПодключениеИБ) Экспорт
	
	Com = СтруктураМетаданных.ПолучитьСтруктуруХранения(СоединениеИБ(ПодключениеИБ));
	ТЗ = СтруктураМетаданных.СтруктураБазыИзComВТаблицуЗначений(Com);
	
	Возврат ТЗ;
	
КонецФункции // СтруктураХраненияБазы()

// Функция возвращает структуру хранения базы данных в виде ТаблицыЗначений.
// При первом обращении к структуре, подключется к ИБ, получает структуру базы
// и сохраняет в контексте. Структура в терминах SDBL
//
// Возвращаемое значение:
//  ТаблицаЗначений, Структура хранения базы данных
//
Функция СтруктураХраненияБазыSDBL(ПодключениеИБ) Экспорт
	
	Com = СтруктураМетаданных.ПолучитьСтруктуруХранения(СоединениеИБ(ПодключениеИБ), Ложь);
	ТЗ = СтруктураМетаданных.СтруктураБазыИзComВТаблицуЗначений(Com);
	
	Возврат ТЗ;
	
КонецФункции // СтруктураХраненияБазыSDBL()

// Получить тип СУБД
//
// Возвращаемое значение:
//  Перечисление.ТипСУБД - тип исследуемой СУБД
//
Функция ТипСУБД(ПодключениеИБ) Экспорт
	
	ТипСУБД = СУБД.ПолучитьТипСУБД(ПодключениеИБ.ИБ.DBMS);
	
	Возврат ТипСУБД;
	
КонецФункции // ТипСУБД()

// Получить версию СУБД
//
// Возвращаемое значение:
//  Число, версия СУБД
//
Функция ВерсияСУБД(ПодключениеИБ, ИмяСервераСУБД, ИмяСервераИБ, СпособАутентификации, Логин, Пароль) Экспорт
	
	ТипСУБД = ТипСУБД(ПодключениеИБ);
	
	Если ТипСУБД = ПредопределенноеЗначение("Перечисление.ТипыСУБД.MSSQLServer") Тогда
		ОбъектВК = КипВнешнийКомпонент.ПолучитьMSSQL();
		MSSQL.ПодключитьMSSQLПоИмениСервера(ОбъектВК, ИмяСервераСУБД, ИмяСервераИБ, СпособАутентификации, Логин, Пароль);
	Иначе
		ОбъектВК = Неопределено;
	КонецЕсли;
	
	ВерсияСУБД = СУБД.ПолучитьВерсиюСУБД(ТипСУБД, ОбъектВК);
	
	Возврат ВерсияСУБД;
	
КонецФункции // ВерсияСУБД()

// Получить тип ОС сервера СУБД
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипОС
//
Функция ТипОССервераСУБД(ОписаниеИБ) Экспорт
	
	Если ОписаниеИБ.ТипСУБД = ПредопределенноеЗначение("Перечисление.ТипыСУБД.MSSQLServer") Тогда
		ТипОС = MSSQL.ТипОССервераСУБД(ОписаниеИБ);
	Иначе
		ТипОС = Перечисления.ТипыОС.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ТипОС;
	
КонецФункции // ТипОССервераСУБД()

// Получить режим управления блокировкой данных
//
// Возвращаемое значение:
//  РежимУправленияБлокировкойДанныхПоУмолчанию - режим управления блокировками
//
Функция РежимУправленияБлокировкойДанных(ПодключениеИБ) Экспорт
	
	СоединениеИБ = СоединениеИБ(ПодключениеИБ);
	Режим = ИнформационнаяБаза.РежимУправленияБлокировкойДанных(СоединениеИБ);
	ТипРежима = СоединениеИБ.Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию;
	
	Если Режим = ТипРежима.Автоматический Тогда
		Режим = Перечисления.РежимыУправленияБлокировкойДанных.Автоматический;
	ИначеЕсли Режим = ТипРежима.АвтоматическийИУправляемый Тогда
		Режим = Перечисления.РежимыУправленияБлокировкойДанных.АвтоматическийИУправляемый;
	ИначеЕсли Режим = ТипРежима.Управляемый Тогда
		Режим = Перечисления.РежимыУправленияБлокировкойДанных.Управляемый;
	КонецЕсли;
		
	
	Возврат Режим;
	
КонецФункции // РежимУправленияБлокировкойДанных()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьРеквизитыСценария(Сценарий) Экспорт
	
	РеквизитыСценария = Новый Структура("НачальноеСостояние,Интерактивный");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сценарии.НачальноеСостояние КАК НачальноеСостояние,
	               |	Сценарии.Интерактивный КАК Интерактивный
	               |ИЗ
	               |	Справочник.Сценарии КАК Сценарии
	               |ГДЕ
	               |	Сценарии.Ссылка = &Сценарий";
	
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыСценария, Выборка);
	КонецЕсли;
	
	Возврат РеквизитыСценария;
	
КонецФункции // ПолучитьРеквизитыСценария()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьОписаниеКоманд() Экспорт
	
	ОписаниеКоманд = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Команда.Ссылка КАК Ссылка,
	|	Команда.Код КАК Код
	|ИЗ
	|	Справочник.Команды КАК Команда";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОписаниеКоманд.Вставить(Выборка.Ссылка, СокрЛП(Выборка.Код));
	КонецЦикла;
	
	Возврат ОписаниеКоманд;
	
КонецФункции // ПолучитьТаблицуКоманд()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьОписаниеПоказателей() Экспорт
	
	ОписаниеПоказателей = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Показатель.Код КАК Код,
	               |	Показатель.Наименование КАК Наименование,
	               |	Показатель.ГраницаЗЖ КАК ГраницаЗЖ,
	               |	Показатель.ГраницаЖК КАК ГраницаЖК,
	               |	Показатель.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	Показатель.Интерактивный КАК Интерактивный,
	               |	Показатель.Линия КАК ЛинияХранилищеЗначения,
	               |	Показатель.Масштаб КАК Масштаб,
	               |	Показатель.Цвет КАК ЦветХранилищеЗначения,
	               |	Показатель.Тип КАК Тип,
	               |	Показатель.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Показатели КАК Показатель
	               |ГДЕ
	               |	НЕ Показатель.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначенияРеквизитов = Новый Структура("Код,Наименование,ГраницаЗЖ,ГраницаЖК,ЕдиницаИзмерения,
			|Интерактивный,Линия,Масштаб,Цвет,Тип");
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Выборка);
		ЗначенияРеквизитов.Цвет = Выборка.ЦветХранилищеЗначения.Получить();
		ЗначенияРеквизитов.Линия = Выборка.ЛинияХранилищеЗначения.Получить();
		
		ОписаниеПоказателей.Вставить(Выборка.Ссылка, ЗначенияРеквизитов);
	КонецЦикла;
	
	Возврат ОписаниеПоказателей;
	
КонецФункции // ПолучитьОписаниеПоказателей()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ИнициализироватьКэшКонстант() Экспорт
	
	КэшКонстант = Новый Структура;
	КэшКонстант.Вставить("СинонимКонфигурации", ОбщегоНазначенияВызовСервера.ПолучитьСиноним());
	КэшКонстант.Вставить("МасштабПоУмолчанию", ОбщегоНазначенияВызовСервера.ПолучитьМасштабПоУмолчанию());
	
	Возврат КэшКонстант;

КонецФункции // ИнициализироватьКэшКонстант()
